CF/DataProcessors/ПодборДокументовВзаимозачета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ПодборДокументовВзаимозачета</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Корзина</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументРасчета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоступнаяСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

CF/AccumulationRegisters/РасчетыСПоставщиками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСПоставщиками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОплате</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПоступлению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СторноЗаказаПоставщику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Взаимозачет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасчета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CF/Documents/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ЗаказПоставщику</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКПоступлению</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейПросрочкиПоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бессрочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьКиЗГИСМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыПлатежныхАгентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭтапыОплат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтсрочкаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПлатежа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидПлатежа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументВзаимозачета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CF/DataProcessors/ПодборДокументовВзаимозачета/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	СуммаКПодбору = Параметры.СуммаКПодбору;
	
	ДокументРасчета = Параметры.ДокументРасчета;
	Магазин = Параметры.Магазин;
	Контрагент = Параметры.Контрагент;
	АдресХранилищаЭтапаОплат = Параметры.АдресХранилищаЭтапаОплат;
	
	ЗаполнитьСписок();
	
	КПодборуПоДокументу = СуммаКПодбору + Объект.Корзина.Итог("Сумма");
	КПодбору = СуммаКПодбору;
	
	УстановитьКнопкуПоУмолчаниюСервер();
	
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовТабличнойЧастиКорзина

&НаКлиенте
Процедура КорзинаСуммаПриИзменении(Элемент)
	
	Отказ = Ложь;
	
	ТекущаяСтрока = Элементы.Корзина.ТекущиеДанные;
	ПроверитьПревышениеДопустимойСуммыВСтроке(ТекущаяСтрока.НомерСтроки - 1);
	
	ТекущиеДанные = Элементы.Корзина.ТекущиеДанные;
	ТекущиеДанные.Пометка = ?(ТекущиеДанные.Сумма > 0, Истина, Ложь);
	
	ОбновитьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура КорзинаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ИмяПоле = Поле.Имя;
	ИмяРеквизита = СтрЗаменить(Поле.Имя, "Корзина", "");
	
	Если ИмяРеквизита <> "ДокументРасчета" Тогда
		Возврат;
	КонецЕсли;
	
	Значение = Элемент.ТекущиеДанные[ИмяРеквизита];
	Если ЗначениеЗаполнено(Значение) Тогда
		ПоказатьЗначение(,Значение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КорзинаПометкаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Корзина.ТекущиеДанные;
	УстановитьСнятьПометку(ТекущиеДанные.Пометка);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ОчиститьСообщения();
	
	Отказ = Ложь;
	
	Для каждого Строка Из Объект.Корзина Цикл
		
		ПроверитьПревышениеДопустимойСуммыВСтроке(Строка.НомерСтроки - 1);
		
	КонецЦикла;
	
	Если Не Отказ Тогда
		ПеренестиВДокумент = Истина;
		
		Если ПеренестиВДокумент Тогда
			СтруктураРезультат = ПоместитьКорзинуВХранилище();
			ОповеститьОВыборе(СтруктураРезультат);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьСписок();
	ОбновитьИтоги();
	УстановитьКнопкуПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммыВзаимозачета(Команда)
	
	КПодбору = КПодборуПоДокументу;
	КПодборуСписывать = КПодбору;
	
	Для Каждого Строка Из Объект.Корзина Цикл
		
		Если КПодборуСписывать > 0 Тогда
			Строка.Сумма = Мин(КПодборуСписывать, Строка.ДоступнаяСумма);
			Строка.Пометка = Строка.Сумма > 0;
			КПодборуСписывать = КПодборуСписывать - Строка.Сумма;
			
		Иначе
			Строка.Сумма = 0;
			Строка.Пометка = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	ОбновитьИтоги();
	УстановитьКнопкуПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	УстановитьСнятьПометку(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	УстановитьСнятьПометку(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписок()
	
	ЭтапыОплат = ПолучитьИзВременногоХранилища(АдресХранилищаЭтапаОплат);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапыОплат.ДокументВзаимозачета КАК ДокументРасчета,
	|	ЭтапыОплат.Сумма КАК Сумма,
	|	ЭтапыОплат.НомерСтроки КАК НомерСтрокиДокумента
	|ПОМЕСТИТЬ ЭтапыОплат
	|ИЗ
	|	&ЭтапыОплат КАК ЭтапыОплат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыБезТекущегоДокумента.ДокументРасчета,
	|	СУММА(РасчетыБезТекущегоДокумента.ДоступнаяСумма) КАК ДоступнаяСумма
	|ПОМЕСТИТЬ РасчетыСПоставщиками
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСПоставщикамиОстатки.ДокументРасчета КАК ДокументРасчета,
	|		РасчетыСПоставщикамиОстатки.КОплатеОстаток КАК ДоступнаяСумма
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщиками.Остатки(
	|				,
	|				Магазин = &Магазин
	|					И Поставщик = &Поставщик
	|					И ЕСТЬNULL(ДокументРасчета.Закрыт, ИСТИНА)
	|					И НЕ(ДокументРасчета = НЕОПРЕДЕЛЕНО
	|							ИЛИ ДокументРасчета = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|							ИЛИ ДокументРасчета = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваров.ПустаяСсылка))) КАК РасчетыСПоставщикамиОстатки
	|	ГДЕ
	|		РасчетыСПоставщикамиОстатки.КОплатеОстаток > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСПоставщиками.ДокументРасчета,
	|		РасчетыСПоставщиками.Сумма
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
	|	ГДЕ
	|		РасчетыСПоставщиками.Регистратор = &ДокументРасчета
	|		И РасчетыСПоставщиками.Взаимозачет) КАК РасчетыБезТекущегоДокумента
	|ГДЕ
	|	РасчетыБезТекущегоДокумента.ДокументРасчета <> &ДокументРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыБезТекущегоДокумента.ДокументРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСПоставщиками.ДокументРасчета КАК ДокументРасчета,
	|	МИНИМУМ(РасчетыСПоставщиками.ДоступнаяСумма) КАК ДоступнаяСумма,
	|	СУММА(ВЫБОР
	|			КОГДА ЭтапыОплат.Сумма > РасчетыСПоставщиками.ДоступнаяСумма
	|				ТОГДА РасчетыСПоставщиками.ДоступнаяСумма
	|			ИНАЧЕ ЭтапыОплат.Сумма
	|		КОНЕЦ) КАК Сумма,
	|	МИНИМУМ(ЭтапыОплат.НомерСтрокиДокумента) КАК НомерСтрокиДокумента,
	|	ВЫБОР
	|		КОГДА ЭтапыОплат.НомерСтрокиДокумента <> 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Пометка
	|ИЗ
	|	РасчетыСПоставщиками КАК РасчетыСПоставщиками
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЭтапыОплат КАК ЭтапыОплат
	|		ПО РасчетыСПоставщиками.ДокументРасчета = ЭтапыОплат.ДокументРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПоставщиками.ДокументРасчета,
	|	ВЫБОР
	|		КОГДА ЭтапыОплат.НомерСтрокиДокумента <> 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетыСПоставщиками.ДокументРасчета.Дата";
	
	Запрос.УстановитьПараметр("Магазин", Магазин);
	Запрос.УстановитьПараметр("Поставщик", Контрагент);
	Запрос.УстановитьПараметр("ЭтапыОплат", ЭтапыОплат);
	Запрос.УстановитьПараметр("ДокументРасчета", ДокументРасчета);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Корзина.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтоги()

	КПодбору = КПодборуПоДокументу - Объект.Корзина.Итог("Сумма");

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПревышениеДопустимойСуммыВСтроке(ТекущаяСтрока)
	
	СтрокаТЧ = Объект.Корзина[ТекущаяСтрока];
	
	Если СтрокаТЧ.Сумма > СтрокаТЧ.ДоступнаяСумма Тогда
		
		ТекстСообщения = НСтр("ru = 'Сумма взаимозачета не должна превышать доступной суммы'");
		Поле = "Объект.Корзина[%ТекущаяСтрока%].Сумма";
		Поле = СтрЗаменить(Поле, "%ТекущаяСтрока%", ТекущаяСтрока);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,Поле);
		
		Если НЕ Отказ Тогда
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьКорзинуВХранилище()
	
	ТЧКорзина = Объект.Корзина.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧКорзина.ДокументРасчета КАК ДокументРасчета,
		|	ТЧКорзина.Сумма КАК Сумма,
		|	ТЧКорзина.НомерСтрокиДокумента КАК НомерСтрокиДокумента
		|ПОМЕСТИТЬ Корзина
		|ИЗ
		|	&ТЧКорзина КАК ТЧКорзина
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Корзина.ДокументРасчета КАК ДокументВзаимозачета,
		|	Корзина.Сумма КАК Сумма,
		|	Корзина.НомерСтрокиДокумента КАК НомерСтрокиДокумента
		|ИЗ
		|	Корзина КАК Корзина
		|ГДЕ
		|	(Корзина.Сумма > 0
		|			ИЛИ Корзина.НомерСтрокиДокумента <> 0)";
		
	Запрос.УстановитьПараметр("ТЧКорзина", ТЧКорзина);
	Результат = Запрос.Выполнить();
	
	Корзина = Результат.Выгрузить();
	
	АдресКорзиныВХранилище = ПоместитьВоВременноеХранилище(Корзина, УникальныйИдентификатор);
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("АдресКорзиныВХранилище", АдресКорзиныВХранилище);
	
	Возврат СтруктураРезультат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьКнопкуПоУмолчанию()
	
	Если КПодбору > 0 И Объект.Корзина.Итог("ДоступнаяСумма") > Объект.Корзина.Итог("Сумма") Тогда
		Элементы.КорзинаЗаполнитьСуммыВзаимозачета.КнопкаПоУмолчанию = Истина;
	Иначе
		Элементы.ФормаПеренестиВДокумент.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКнопкуПоУмолчаниюСервер()
	
	Если КПодбору > 0 И Объект.Корзина.Итог("ДоступнаяСумма") > Объект.Корзина.Итог("Сумма") Тогда
		Элементы.КорзинаЗаполнитьСуммыВзаимозачета.КнопкаПоУмолчанию = Истина;
	Иначе
		Элементы.ФормаПеренестиВДокумент.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьПометку(Пометка)
	
	ВыделенныеСтроки = Элементы.Корзина.ВыделенныеСтроки;
	
	Для Каждого Идентификатор Из ВыделенныеСтроки Цикл
		Строка = Объект.Корзина.НайтиПоИдентификатору(Идентификатор);
		Строка.Пометка = Пометка;
		
		Если Строка.Сумма = 0 И Пометка Тогда
			Строка.Сумма = Мин(Строка.ДоступнаяСумма, КПодбору);
			
		ИначеЕсли Не Пометка Тогда
			Строка.Сумма = 0;
		КонецЕсли;
		
		ОбновитьИтоги();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
